src/cf/src/InformationRegisters/отусСтоимостьДепозитаАренды/отусСтоимостьДепозитаАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>отусСтоимостьДепозитаАренды</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Депозит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Аренда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>CatalogRef._ДемоНоменклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/CommonModules/отусАрендаИнструментаВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает цены депозита и аренды инструмента
//
// Параметры:
//	Дата - ДатаВремя - Дата запроса цен
//	Инструмент - СправочникСсылка._ДемоНоменклатура - Инструмент
//
// Возвращаемое значение:
//	Структура - Структура с значениями:
//		* Депозит - Число - стоимость депозита
//		* Аренда - Число - стоимость аренды
//
Функция ПолучитьЦеныИнструмента(Инструмент, Дата = '00010101') Экспорт
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	отусСтоимостьДепозитаАрендыСрезПоследних.Инструмент КАК Инструмент,
	|	отусСтоимостьДепозитаАрендыСрезПоследних.Депозит КАК Депозит,
	|	отусСтоимостьДепозитаАрендыСрезПоследних.Аренда КАК Аренда
	|ИЗ
	|	РегистрСведений.отусСтоимостьДепозитаАренды.СрезПоследних(&Дата, Инструмент = &Инструмент) КАК отусСтоимостьДепозитаАрендыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Инструмент", Инструмент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Депозит,Аренда", Выборка.Депозит, Выборка.Аренда);
	КонецЕсли;
	
	Возврат Новый Структура("Депозит,Аренда", 0, 0);
		
КонецФункции 

#КонецОбласти
